Revit 2027 API
BuiltInFailures.StairRampFailures.RampLandingNotCreated Property
 Beginning of run coincide with the end of previous run. Landing is not created between runs.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RampLandingNotCreated { get; }
Public Shared ReadOnly Property RampLandingNotCreated As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RampLandingNotCreated {
	FailureDefinitionId^ get ();
}
static member RampLandingNotCreated : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace